weifengdq/embedded/tc364/tc364_can_x8_gcc/Libraries/Infra/Sfr/TC36x/IfxMtu_bf.h
/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.SCR_RAMINT_EN */
#define IFX_MTU_MEMTEST2_SCR_RAMINT_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.SCR_RAMINT_EN */
#define IFX_MTU_MEMTEST2_SCR_RAMINT_EN_OFF (14u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.GIGETH_RX_EN */
#define IFX_MTU_MEMTEST2_GIGETH_RX_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.GIGETH_RX_EN */
#define IFX_MTU_MEMTEST2_GIGETH_RX_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.GIGETH_RX_EN */
#define IFX_MTU_MEMTEST2_GIGETH_RX_EN_OFF (18u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.GIGETH_TX_EN */
#define IFX_MTU_MEMTEST2_GIGETH_TX_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.GIGETH_TX_EN */
#define IFX_MTU_MEMTEST2_GIGETH_TX_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.GIGETH_TX_EN */
#define IFX_MTU_MEMTEST2_GIGETH_TX_EN_OFF (19u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU0_DCMAP */
#define IFX_MTU_MEMMAP_CPU0_DCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU0_DCMAP */
#define IFX_MTU_MEMMAP_CPU0_DCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU0_DCMAP */
#define IFX_MTU_MEMMAP_CPU0_DCMAP_OFF (0u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU0_DTMAP */
#define IFX_MTU_MEMMAP_CPU0_DTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU0_DTMAP */
#define IFX_MTU_MEMMAP_CPU0_DTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU0_DTMAP */
#define IFX_MTU_MEMMAP_CPU0_DTMAP_OFF (1u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU0_PCMAP */
#define IFX_MTU_MEMMAP_CPU0_PCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU0_PCMAP */
#define IFX_MTU_MEMMAP_CPU0_PCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU0_PCMAP */
#define IFX_MTU_MEMMAP_CPU0_PCMAP_OFF (2u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU0_PTMAP */
#define IFX_MTU_MEMMAP_CPU0_PTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU0_PTMAP */
#define IFX_MTU_MEMMAP_CPU0_PTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU0_PTMAP */
#define IFX_MTU_MEMMAP_CPU0_PTMAP_OFF (3u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU1_DCMAP */
#define IFX_MTU_MEMMAP_CPU1_DCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU1_DCMAP */
#define IFX_MTU_MEMMAP_CPU1_DCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU1_DCMAP */
#define IFX_MTU_MEMMAP_CPU1_DCMAP_OFF (5u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU1_DTMAP */
#define IFX_MTU_MEMMAP_CPU1_DTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU1_DTMAP */
#define IFX_MTU_MEMMAP_CPU1_DTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU1_DTMAP */
#define IFX_MTU_MEMMAP_CPU1_DTMAP_OFF (6u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU1_PCMAP */
#define IFX_MTU_MEMMAP_CPU1_PCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU1_PCMAP */
#define IFX_MTU_MEMMAP_CPU1_PCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU1_PCMAP */
#define IFX_MTU_MEMMAP_CPU1_PCMAP_OFF (7u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU1_PTMAP */
#define IFX_MTU_MEMMAP_CPU1_PTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU1_PTMAP */
#define IFX_MTU_MEMMAP_CPU1_PTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU1_PTMAP */
#define IFX_MTU_MEMMAP_CPU1_PTMAP_OFF (8u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM10MAP */
#define IFX_MTU_MEMMAP_MEM10MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM10MAP */
#define IFX_MTU_MEMMAP_MEM10MAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.MEM10MAP */
#define IFX_MTU_MEMMAP_MEM10MAP_OFF (10u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM11MAP */
#define IFX_MTU_MEMMAP_MEM11MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM11MAP */
#define IFX_MTU_MEMMAP_MEM11MAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.MEM11MAP */
#define IFX_MTU_MEMMAP_MEM11MAP_OFF (11u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM12MAP */
#define IFX_MTU_MEMMAP_MEM12MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM12MAP */
#define IFX_MTU_MEMMAP_MEM12MAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.MEM12MAP */
#define IFX_MTU_MEMMAP_MEM12MAP_OFF (12u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM13MAP */
#define IFX_MTU_MEMMAP_MEM13MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM13MAP */
#define IFX_MTU_MEMMAP_MEM13MAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.MEM13MAP */
#define IFX_MTU_MEMMAP_MEM13MAP_OFF (13u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM15MAP */
#define IFX_MTU_MEMMAP_MEM15MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM15MAP */
#define IFX_MTU_MEMMAP_MEM15MAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.MEM15MAP */
#define IFX_MTU_MEMMAP_MEM15MAP_OFF (15u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM16MAP */
#define IFX_MTU_MEMMAP_MEM16MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM16MAP */
#define IFX_MTU_MEMMAP_MEM16MAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.MEM16MAP */
#define IFX_MTU_MEMMAP_MEM16MAP_OFF (16u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM17MAP */
#define IFX_MTU_MEMMAP_MEM17MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM17MAP */
#define IFX_MTU_MEMMAP_MEM17MAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.MEM17MAP */
#define IFX_MTU_MEMMAP_MEM17MAP_OFF (17u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM18MAP */
#define IFX_MTU_MEMMAP_MEM18MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM18MAP */
#define IFX_MTU_MEMMAP_MEM18MAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.MEM18MAP */
#define IFX_MTU_MEMMAP_MEM18MAP_OFF (18u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM20MAP */
#define IFX_MTU_MEMMAP_MEM20MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM20MAP */
#define IFX_MTU_MEMMAP_MEM20MAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.MEM20MAP */
#define IFX_MTU_MEMMAP_MEM20MAP_OFF (20u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM21MAP */
#define IFX_MTU_MEMMAP_MEM21MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM21MAP */
#define IFX_MTU_MEMMAP_MEM21MAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.MEM21MAP */
#define IFX_MTU_MEMMAP_MEM21MAP_OFF (21u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM22MAP */
#define IFX_MTU_MEMMAP_MEM22MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM22MAP */
#define IFX_MTU_MEMMAP_MEM22MAP_MSK (0x1u)

